# ProjectPosition Class

---
ProjectPosition is a class used to represent a geographical offset and rotation. It can be used to represent the position of a project.
SystemObject Autodesk.Revit.DBProjectPosition
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ProjectPosition : IDisposable

    Public Class ProjectPosition
    	Implements IDisposable

    public ref class ProjectPosition : IDisposable

    type ProjectPosition =
        class
            interface IDisposable
        end
The ProjectPosition type exposes the following members.
| Name| Description
---|---|---
| ProjectPosition(ProjectPosition)|  Creates a copy of the ProjectPosition.
| ProjectPosition(Double, Double, Double, Double)|  Construct a new ProjectPosition with the specified East/West offset, North/South offset, elevation offset, and angle of rotation.
Top
| Name| Description
---|---|---
| Angle|  Angle from True North.
| EastWest|  East/West offset.
| Elevation|  Elevation above ground level.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| NorthSouth|  North/South offset
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ProjectPosition
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace